Revit 2026 API

# FabricationConfigurationInfoFindSourceFabricationConfiguration Method

---

Finds the source fabrication configuration on disk which matches the input fabrication configuration.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FabricationConfigurationInfo FindSourceFabricationConfiguration(
	FabricationConfigurationInfo fabricationConfiguration
)
```
```vb
Public Shared Function FindSourceFabricationConfiguration (
	fabricationConfiguration As FabricationConfigurationInfo
) As FabricationConfigurationInfo
```
```cpp
public:
static FabricationConfigurationInfo^ FindSourceFabricationConfiguration(
	FabricationConfigurationInfo^ fabricationConfiguration
)
```
```fsharp
static member FindSourceFabricationConfiguration :
        fabricationConfiguration : FabricationConfigurationInfo -> FabricationConfigurationInfo
```

#### Parameters

fabricationConfiguration FabricationConfigurationInfo
     The fabrication configuration to match.

#### Return Value

FabricationConfigurationInfo The matching source fabrication configuration.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Fabrication configuration is matched by configuration GUID and version. The GUIDs are required to be the same. For version, we first try to match the version exactly. If Revit cannot find an exact match, then it looks for the closest version later than the input configuration, then the closest earlier version.

#### Reference

FabricationConfigurationInfo Class

Autodesk.Revit.DB Namespace